 
 gcc -g p0final.c
 ./a.out
my name is Divya 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x64e: file p0final.c, line 4.
(gdb) r
Starting program: /home/runner/pps-test1-Divyakn52-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p0final.c:4
4     printf("my name is Divya");
(gdb) n
5     return 0;
(gdb) c
Continuing.
my name is Divya[Inferior 1 (process 100) exited normally]
(gdb) b main
Note: breakpoint 1 also set at pc 0x55b84f80064e.
Breakpoint 2 at 0x55b84f80064e: file p0final.c, line 4.
(gdb) r
Starting program: /home/runner/pps-test1-Divyakn52-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p0final.c:4
4     printf("my name is Divya");
(gdb) n
5     return 0;
(gdb) q
A debugging session is active.

    Inferior 1 [process 107] will be killed.

Quit anyway? (y or n) y
 ^C
 ^C
